{
    "keys":{
        "use":{
            "correct":"You use the keys on the BMW and it unlocks. You also use the keys to open the trunk as well.",
            "incorrect":"That doesn't appear to be the correct usage of that item."
        }
    },
    "passphrase":{
        "use":{
            "correct":"You type in the passphrase into the keypad in the door. *CLICK* You hear the door unlock and open slightly.",
            "incorrect":"That doesn't appear to be the correct usage of that item."
        }
    },
    "safe combination":{
        "use":{
            "correct":"You using the safe combination and spin the dial to the matching numbers. *CLICK* you hear the safe unlock.",
            "incorrect":"That doesn't appear to be the correct usage of that item."
        }
    },
    "bolt cutters":{
        "use":{
            "correct":"You place the chain in the mouth of the bolt cutters. With as much strength as you can muster, you strain to clamp down the bolt cutters. With a sudden *SNAP* the chain is cut! Sarah has been freed!",
            "incorrect":"That doesn't appear to be the correct usage of that item."
        }
    },
    "flashlight":{
        "use":{
            "correct":"You turn on the flashlight and approach the wall. You methodically examine every inch of the wall until you finally spot a keyhole that was previously hidden in the dark. ",
            "incorrect":"You turn on the flashlight and shine it around but it doesn't seem to help."
        }
    },
    "silver key":{
        "use":{
            "correct":"You insert the silver key into the keyhole hidden in the wall and give it a turn. *CLICK* You hear the something unlock and the wall gives way, revealing the fact that it is actually a door.",
            "incorrect":"That doesn't appear to be the correct usage of that item."
        }
    },
    "engraved key":{
        "use":{
            "correct":"You insert the engraved key into the slot on the desk and push it all the way in. *CLICK* you hear a noise coming from the bookself directly in front of you. You look up and see it swing open into the room, revealing a door behind it.",
            "incorrect":"That doesn't appear to be the correct usage of that item."
        }
    },
    "diary key":{
        "use":{
            "correct":"You insert the diary key into the small keyhole in the diary and turn. The leather strap instantly unlocks. You open the diary up and give it a read. Glancing through the pages, you find a passage where Sarah explains how her father showed her there was a panic room located behind a bookshelf in the library that could be accessed by inserting an engraved key into a slot on top of the desk located in the room.",
            "incorrect":"That doesn't appear to be the correct usage of that item."
        }
    }
}