{
    "location": "Master Suite",
    "long description": "The Master Suite is decorated in a display of obscene wealth as the rest of the house. You have never seen such an extravagant display of wealth before. On the western wall there is portrait of the couple. Next to the bed are several small crystal containers on an end table. On the north wall is an intricately carved mahogany door leading the Grand Room. The solid oak door located on the east wall leads into the Family Room. To the south is a rosewood sliding door leading toward the Library.",
    "short description": "You are in the Master Suite. To the north is an intricately carved mahogany door the Grand Room, to the South is a rosewood sliding door leading into the Library, and the solid oak door to the east leads to the Family Room. In the room you see a portrait and crystal containers on an end table.",
    "look at": {
        "portrait": {
            "not moved": "The portrait is of the Mayor and his wife and seems recently commissioned based on their ages. While moving closer to the portrait to get a better look, you notice that the frame seems to be hanging slightly farther away from the wall than you would expect. It seems like it can be moved.",
            "moved": "The portrait has been moved and reveals a hidden safe that is located behind it."
        },
        "safe": {
            "locked": "The safe sits locked in the wall, awaiting the correct combination.",
            "unlocked": "The safe sits in the wall unlocked. You look inside and find a stack of financial documents, bills, and accounts information. Taking a closer look, it appears that the Mayor was shifting quite a bit of money around. On the bottom of the stack of papers, you find a passphrase scrawled on a piece of paper. This could come in handy later.",
            "unlocked not taken passphrase": "The safe sits in the wall unlocked. You look inside and find the same stack of financial documents, bills, and accounts information that you discovered earlier. On the bottom of the stack of papers is the passphrase. You should hold on to this for later.",
            "unlocked and taken": "The safe sits in the wall unlocked. You look inside and file the same stack of financial documents, bills, and accounts information. Sifting through the rest of the documents you remember that the passphrase has already been taken."
        },
        "end table": "You approach the end table and examine the small crystal containers. You notice a faint smell in the air. Lifting a lid you realize these are bottles of perfume and cologne. Smells pretty good if you do say so yourself."
    },
    "exits": {
        "north": "Grand Room",
        "east": "Family Room",
        "south": "Library"
    }
}