{
    "location": "Second Floor Foyer",
    "long description": "As you reach the top of the staircase, you find yourself on the landing of the second floor. The spacious entryway you find yourself in is the Second Floor Foyer. Taking in the view of the room, the only notable feature seems to be the table with drawers positioned against the wall. Behind you is the southern staircase that leads back down to the First Floor Foyer. To the west is a door littered with hand drawn pictures attached to its surface. That must be the Sarah’s Room. To the east is you see a Study.",
    "short description": "You are in the Second Floor Foyer. To the west is Sarah's Room, to the east is the Study, and to the South is the staircase leading to the First Floor Foyer. Of note in the room is a table with drawers.",
    "look at":{
        "table": "You approach the table and notice that a copy of yesterdays newspaper has been left here. Glancing at the front page you read the headline Day 4: Kidnapping investigation still underway. Has it really only been 4 days you think to yourself. You were proud at first to have been detailed to the investigation team but quickly found the couple to be surprisingly uncooperative when trying to question them. Your superiors said they must just be in shock, but when you continued to press them suddenly you found yourself stuck on desk duty doing grunt work. You have always relied on your instincts and they were now screaming at you that something didnt add up in this case. Snapping out of your thoughts, you further resolve yourself to get to the bottom of this case. ",
        "drawers":{
            "before taking key": "Opening up one of the drawers, you notice an engraved key rolling around at the bottom of the drawer. Perhaps this could be helpful later on.",
            "reexamining without having taken key":"Opening up one of the drawers, you notice the engraved key still rolling about inside. Perhaps this could be of use.",
            "after taking coded key": "Opening the drawers, you find nothing else of value."
        }
    },
    "exits": {
        "east":"Study",
        "south":"First Floor Foyer",
        "west":"Sarah's Room"
    }
}